
## Plan Result

[CI link](https://github.com/enokawa/terraform-sandbox/actions/runs/4762557223)


<pre><code>Plan: 9 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.vpc_secutiry_group.aws_security_group.ec2_bastion
  * module.vpc_secutiry_group.aws_security_group.lambda_api
  * module.vpc_secutiry_group.aws_security_group.rds
  * module.vpc_secutiry_group.aws_security_group_rule.ec2_bastion_egress_allow_all
  * module.vpc_secutiry_group.aws_security_group_rule.ec2_bastion_ingress_allow_ssh
  * module.vpc_secutiry_group.aws_security_group_rule.lambda_api_egress_allow_all
  * module.vpc_secutiry_group.aws_security_group_rule.rds_egress_allow_all
  * module.vpc_secutiry_group.aws_security_group_rule.rds_ingress_allow_3306_from_ec2_bastion
  * module.vpc_secutiry_group.aws_security_group_rule.rds_ingress_allow_3306_from_lambda_api


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.vpc_secutiry_group.aws_security_group.ec2_bastion will be created
  + resource "aws_security_group" "ec2_bastion" {
      + arn                    = (known after apply)
      + description            = "dev-sandbox-ec2-bastion-1"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "dev-sandbox-ec2-bastion-1"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "dev-sandbox-ec2-bastion-1"
        }
      + tags_all               = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Name"        = "dev-sandbox-ec2-bastion-1"
          + "ProjectName" = "sandbox"
        }
      + vpc_id                 = "vpc-04aede4e87135b698"
    }

  # module.vpc_secutiry_group.aws_security_group.lambda_api will be created
  + resource "aws_security_group" "lambda_api" {
      + arn                    = (known after apply)
      + description            = "dev-sandbox-lambda-api-1"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "dev-sandbox-lambda-api-1"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "dev-sandbox-lambda-api-1"
        }
      + tags_all               = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Name"        = "dev-sandbox-lambda-api-1"
          + "ProjectName" = "sandbox"
        }
      + vpc_id                 = "vpc-04aede4e87135b698"
    }

  # module.vpc_secutiry_group.aws_security_group.rds will be created
  + resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "dev-sandbox-rds-1"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "dev-sandbox-rds-1"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "dev-sandbox-rds-1"
        }
      + tags_all               = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Name"        = "dev-sandbox-rds-1"
          + "ProjectName" = "sandbox"
        }
      + vpc_id                 = "vpc-04aede4e87135b698"
    }

  # module.vpc_secutiry_group.aws_security_group_rule.ec2_bastion_egress_allow_all will be created
  + resource "aws_security_group_rule" "ec2_bastion_egress_allow_all" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.vpc_secutiry_group.aws_security_group_rule.ec2_bastion_ingress_allow_ssh will be created
  + resource "aws_security_group_rule" "ec2_bastion_ingress_allow_ssh" {
      + from_port                = 22
      + id                       = (known after apply)
      + prefix_list_ids          = [
          + "pl-0eb0f7e0fac0b42a9",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.vpc_secutiry_group.aws_security_group_rule.lambda_api_egress_allow_all will be created
  + resource "aws_security_group_rule" "lambda_api_egress_allow_all" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.vpc_secutiry_group.aws_security_group_rule.rds_egress_allow_all will be created
  + resource "aws_security_group_rule" "rds_egress_allow_all" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.vpc_secutiry_group.aws_security_group_rule.rds_ingress_allow_3306_from_ec2_bastion will be created
  + resource "aws_security_group_rule" "rds_ingress_allow_3306_from_ec2_bastion" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.vpc_secutiry_group.aws_security_group_rule.rds_ingress_allow_3306_from_lambda_api will be created
  + resource "aws_security_group_rule" "rds_ingress_allow_3306_from_lambda_api" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":9,"Program":"tfcmt","SHA1":"ed42bbead5273e26035ea7c8ab0cd55e86c1c18a","Vars":{},"WorkflowName":"Terraform Plan (develop)"} -->